[
    {
      "index": 1,
      "name": "When waking up",
      "english": "All praise is for Allah who gave us life after having taken it from us and unto Him is the resurrection.",
      "arabic": "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور"
    },
    {
      "index": 2,
      "name": "Supplication when wearing a garment",
      "english": "All Praise is for Allah who has clothed me with this garment and provided it for me, with no power nor might from myself.",
      "arabic": "الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة "
    },
    {
      "index": 4,
      "name": "Supplication said to someone wearing a new garment",
      "english": "May you wear it out and Allah تعالى replace it (with another).’ The intended meaning: A supplication for long life.",
      "arabic": "تُبْـلي وَيُـخْلِفُ اللهُ تَعَالى "
    },
    {
      "index": 5,
      "name": "Before undressing",
      "english": "In the name of Allah.",
      "arabic": "بِسْمِ الله "
    },
    {
      "index": 6,
      "name": "Before entering the toilet",
      "english": "(In the name of Allah).  O Allah, I take refuge with you from all evil and evil-doers.",
      "arabic": "(بِسْمِ الله ) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث"
    },
    {
      "index": 7,
      "name": "After leaving the toilet",
      "english": "I ask You (Allah) for forgiveness.",
      "arabic": " غُفْـرانَك "
    },
    {
      "index": 8,
      "name": "When starting ablution",
      "english": "In the name of Allah.",
      "arabic": "بِسْمِ الله "
    },
    {
      "index": 9,
      "name": "Upon completing the ablution",
      "english": "I bear witness that none has the right to be worshipped except Allah, alone without partner, and I bear witness that Muhammad is His slave and Messenger.",
      "arabic": "أَشْهَدُ أَنْ لا إِلَـهَ إِلاّ اللهُ وَحْدَهُ لا شَريـكَ لَـهُ وَأَشْهَدُ أَنَّ مُحَمّـداً عَبْـدُهُ وَرَسـولُـه"
    },
    {
      "index": 10,
      "name": "When leaving the home",
      "english": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah.",
      "arabic": "بِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله "
    },
    {
      "index": 11,
      "name": "Upon entering the home",
      "english": "In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust.",
      "arabic": "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا "
    },
   
    {
      "index": 15,
      "name": "Supplications related to the athan",
      "english": "come to prayer, come to success’ instead, one should say: لا حَـوْلَ وَلا قُـوَّةَ إِلاّ بِالله",
      "arabic": "One repeats just as the mu-aththin (one who calls to prayer) says, except when he says: حَـيَّ عَلـى الصَّلاة (أَو) حَـيَّ عَلـى الْفَـلاح"
    },
   
    {
      "index": 17,
      "name": "While bowing in prayer (ruku)",
      "english": "How perfect my Lord is, The Supreme. (three times)",
      "arabic": "سُبْـحانَ رَبِّـيَ الْعَظـيم . (ثلاثاً)"
    },
    {
      "index": 18,
      "name": "Upon rising from the bowing position",
      "english": "May Allah answer he who praises Him.’ This supplication is to be made while rising.",
      "arabic": "سَمِـعَ اللهُ لِمَـنْ حَمِـدَه "
    },
    {
      "index": 19,
      "name": "Supplication whilst prostrating (sujood)",
      "english": "How perfect my Lord is, The Most High. (three times)",
      "arabic": "سُبْـحانَ رَبِّـيَ الأَعْلـى . (ثلاثاً )"
    },
    {
      "index": 20,
      "name": "Supplication between the two prostrations",
      "english": "My Lord forgive me, My Lord forgive me.",
      "arabic": "رَبِّ اغْفِـرْ لي  ، رَبِّ اغْفِـرْ لي "
    },
    
    {
      "index": 36,
      "name": "Upon encountering an enemy or those of authority",
      "english": "‘O Allah, we place You before them and we take refuge in You from their evil.’",
      "arabic": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوْذُ بِكَ مِنْ شُرُوْرِهِمْ"
    },
    {
      "index": 37,
      "name": "Supplication for one afflicted with doubt in his faith",
      "english": "One should seek refuge in AllahOne should renounce that which is causing such doubt.",
      "arabic": "يَسْتَعِيْذُ بِاللهِ"
    },
    {
      "index": 38,
      "name": "Settling a debt",
      "english": "‘O Allah, make what is lawful enough for me, as opposed to what is unlawful, and spare me by Your grace, of need of others.’",
      "arabic": "اللَّهمَّ اكْفِنِي بِحَلالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ"
    },
    {
      "index": 39,
      "name": "Supplication for one afflicated by whisperings in prayer or recitation",
      "english": "Uthman Ibn Al-Aas narrated: I said ‘O Messenger of Allah (saw), verily the devil comes between me and my prayer and recitation making me confused’ The Messenger of Allah (saw) replied ‘That is a devil called Khanzab, so if you sense his presence then seek refuge in Allah from him and spit on your left side three times.’",
      "arabic": "أعوذ بالله من الشيطان الرجيم واتفل على يسارك ( ثلاثا )"
    },
    {
      "index": 40,
      "name": "Supplication for one whose affairs have become difficult",
      "english": "‘O Allah, there is no ease except in that which You have made easy, and You make the difficulty, if You wish, easy.’",
      "arabic": "اللّهُـمَّ لا سَـهْلَ إِلاّ ما جَعَلـتَهُ سَهـلاً، وَأَنْتَ تَجْـعَلُ الْحَـزَنَ إِذا شِـئْتَ سَهـْلاً"
    },
    {
      "index": 41,
      "name": "Upon committing a sin",
      "english": "‘Any servant who commits a sin and as a result, performs ablution, prays two units of prayer (i.e. two rakahs) and then seeks Allah’s forgiveness, Allah would forgive him.’",
      "arabic": "ما من عبد يذنب ذنبا فيحسن الطهور، ثم يقوم فيصلي ركعتين، ثم يستغفر الله إلا غفر الله له"
    },
    {
      "index": 42,
      "name": "Supplication for expelling the devil and his whisperings",
      "english": "Seeking refuge from him.",
      "arabic": "الإستعاذة بالله منه"
    },
    {
      "index": 43,
      "name": "Supplication when stricken with a mishap or overtaken by an affair",
      "english": "‘Allah has decreed and what He wills, He does.’",
      "arabic": "قَدَّرَ اللَّهُ وَمَا شَاءَ فَعَلَ"
    },
  
    {
      "index": 45,
      "name": "When visiting the sick",
      "english": "When the Prophet (saw) would enter upon a sick person, he would say:‘Never mind, may it (the sickness) be a purification, if Allah wills.’",
      "arabic": "لا بَأْسَ طَهُوْر ٌ إِنْ شَاءَ ال"
    },
  
    {
      "index": 47,
      "name": "Supplication of the sick who have renounced all hope of life",
      "english": "‘O Allah, forgive me, have mercy upon me and unite me with the higher companions.’Refer to the Quran, chapter 4, verse: 69",
      "arabic": "اللَّهمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيْقِ الأَعْلَى"
    },
    {
      "index": 48,
      "name": "Instruction for the one nearing death",
      "english": "Those around the sick should instruct and encourage him to say the shahadah.‘He whose last words are:‘None has the right to be worshipped except Allah. ...will enter Paradise.’",
      "arabic": "لا إِلَهََ إِلاَّ ال"
    },
   
    {
      "index": 54,
      "name": "Placing the deceased in the grave",
      "english": " ‘In the name of Allah and upon the sunnah of the Messenger of Allah.’",
      "arabic": "بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُوْلِ ال"
    },
    {
      "index": 55,
      "name": "After burying the deceased",
      "english": "‘After the Prophet (saw) would bury the deceased he would stand by the grave and say: ‘Seek forgiveness for your brother and pray that he remains firm, for he is now being questioned’.’",
      "arabic": "اللَّهُمَّ اغْفِرْ لَهُ, اللَّهُمَّ ثَبِّتْهُ"
    },
  
    {
      "index": 57,
      "name": "Prayer said during a wind storm",
      "english": " ‘O Allah, I ask You for it’s goodness and I take refuge with You from it’s evil.’",
      "arabic": "اللَّهمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوْذُ بِكَ مِنْ شَرِّهَا"
    },
    {
      "index": 58,
      "name": "Supplication upon hearing thunder",
      "english": "When Abdullah Ibn Az-Zubayr (ra) used to hear thunder he would stop talking and say:‘How perfect He is, (The One) Whom the thunder declares His perfection with His praise, as do the angels out of fear of Him.’",
      "arabic": "سُبْحانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالمَلائِكَةُ مِنْ خِيْفَتِهِ"
    },
    {
      "index": 59,
      "name": "Supplication for rain",
      "english": "‘O Allah, send upon us helpful, wholesome and healthy rain, beneficial not harmful rain, now, not later.’",
      "arabic": "اللَّهمَّ اسْقِنَا غَيْثا ً مُغِيْثا ً مَرِيْئا ً مُرِيْعا، ً نَافِعاً غَيْرَ ضَارّ،ٍ عَاجِلاً غَيْرَ آجِل.ٍ"
    },
    {
      "index": 60,
      "name": "Supplication said when it rains",
      "english": " ‘O Allah, may it be a beneficial rain cloud.’",
      "arabic": "اللَّهمَّ صَيِّبا ً نَافِعا.ً"
    },
    {
      "index": 61,
      "name": "After rainfall",
      "english": "‘We have been given rain by the grace and mercy of Allah.’",
      "arabic": "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ"
    },
    {
      "index": 62,
      "name": "Asking for clear skies",
      "english": "‘O Allah, let the rain fall around us and not upon us, O Allah, (let it fall) on the pastures, hills, valleys and the roots of trees.’",
      "arabic": "للَّهمَّ حَوَالَيْنَا وَلا عَلَيْنَا، اللَّهمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُوْنِ الأَوْدِيَةِ، وَمَنابِتِ الشَّجَر"
    },
    {
      "index": 64,
      "name": "Upon breaking fast",
      "english": " ‘The thirst has gone and the veins are quenched, and reward is confirmed, if Allah wills.’",
      "arabic": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوْقُ، وَثَبَتَ الأَجْرُ إِنْ شَاءَ ٱللَّٰهُ"
    },
    {
      "index": 65,
      "name": "Supplication before eating",
      "english": "‘When you are about to eat, you should say:‘In the name of Allah...and if you forget to say it before starting, then you should say (when you remember):‘In the name of Allah in it’s beginning and end.’",
      "arabic": "بِسْمِ اللَّهِ. بِسْمِ اللَّهِ فِي أَوَّلِه ِِ وَآخِرِهِ."
    },
    {
      "index": 66,
      "name": "Upon completing the meal",
      "english": " ‘All praise is for Allah who fed me this and provided it for me without any might nor power from myself.’",
      "arabic": "الحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا وَرَزَقَنِيْهِ مِنْ غَيْرِ حَوْل ٍ مِنِّي وَلا قُوَّة.ٍ "
    },
    {
      "index": 67,
      "name": "Supplication of the guest for the host",
      "english": " ‘O Allah, bless for them, that which You have provided them, forgive them and have mercy upon them.’",
      "arabic": "اللَّهمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ."
    },
    {
      "index": 68,
      "name": "Supplication said to one offering a drink or to one who intended to do that",
      "english": "‘O Allah, feed him who fed me, and provide with drink him who provided me with drink.’",
      "arabic": "اللَّهمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي"
    },
    {
      "index": 69,
      "name": "Supplication said when breaking fast in someone's home",
      "english": "‘May the fasting break their fast in your home, and may the dutiful and pious eat your food, and may the angles send prayers upon you.’",
      "arabic": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُوْنَ وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ"
    },
  
    {
      "index": 75,
      "name": "Supplication before sexual intercourse",
      "english": "‘In the name of Allah. O Allah, keep the devil away from us and keep the devil away from what you have blessed us with.’",
      "arabic": "بِسْمِ اللَّهِ اللَّهمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا"
    },
    {
      "index": 76,
      "name": "When angry",
      "english": "‘I take refuge with Allah from the accursed devil.’",
      "arabic": "أَعُوْذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ"
    },
    {
      "index": 77,
      "name": "Supplication said upon seeing someone in trial or tribulation",
      "english": "This supplication is to be said to one’s self, not directly to the one in trial or tribulation.‘All praise is for Allah Who saved me from that which He tested you with and Who most certainly favoured me over much of His creation.’",
      "arabic": "الحَمْدُ للهِ الَّذِي عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثيْر ٍ مِمَّنْ خَلَقَ تَفْضِيْلا.ً "
    },
  
    {
      "index": 79,
      "name": "Supplication for the expiation of sins said at the conclusion of a sitting or gathering (and Supplication for concluding all sittings)",
      "english": "‘How perfect You are O Allah, and I praise You.  I bear witness that None has the right to be worshipped except You.  I seek Your forgiveness and turn to You in repentance.’",
      "arabic": "سُبْحَانَكَ اللَّهمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لا إِلَهََ إِلاَّ أَنْتَ أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ"
    },
    {
      "index": 80,
      "name": "Returning a supplication of forgiveness",
      "english": "‘Abdullah Ibn Sarjis (ra) said: ‘I went to see the Prophet (saw) and ate from his food and then said to him:‘May Allah forgive you, O Messenger of Allah.’he (saw) replied: ‘and you.’",
      "arabic": "غَفَرَ اللَّهُ لَكَ.  وَلَكَ"
    },
    {
      "index": 81,
      "name": "Supplication said to one who does you a favour",
      "english": "‘If someone does you a favour and you say: ‘May Allah reward you with goodness.’…then you have indeed excelled in praising him.’",
      "arabic": "جَزَاكَ اللَّهُ خَيْرا.ً"
    },
  
    {
      "index": 83,
      "name": "Supplication said to one who pronounces his love for you, for Allah's sake",
      "english": "‘May He, for whom you have loved me, love you.’",
      "arabic": "أَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ"
    },
    {
      "index": 84,
      "name": "Supplication said to one who has offered you some of his wealth",
      "english": "May Allah bless for you, your family and wealth.",
      "arabic": "بارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك"
    },
    {
      "index": 85,
      "name": "Supplication said to the debtor when his debt is settled",
      "english": "May Allah bless for you, your family and wealth. Surely commendation and payment are the reward for a loan.",
      "arabic": "بارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّما جَـزاءُ السَّلَفِ الْحَمْدُ والأَداء"
    },
    {
      "index": 86,
      "name": "Supplication for fear of shirk",
      "english": "O Allah, I take refuge in You lest I should commit shirk with You knowingly and I seek Your forgiveness for what I do unknowingly.",
      "arabic": "اللّهُـمَّ إِنّـي أَعـوذُبِكَ أَنْ أُشْـرِكَ بِكَ وَأَنا أَعْـلَمْ، وَأَسْتَـغْفِرُكَ لِما لا أَعْـلَم"
    },
    {
      "index": 87,
      "name": "Returning a supplication after having bestowed a gift or charity upon someone",
      "english": "May Allah bless you all.",
      "arabic": "وَفيكَ بارَكَ الله"
    },
    {
      "index": 88,
      "name": "Forbiddance of ascribing things to omens",
      "english": "O Allah, there is no omen but there is reliance on You, there is no good except Your good and none has the right to be worshipped except You.",
      "arabic": "اللّهُـمَّ لا طَيْـرَ إِلاّ طَيْـرُك، وَلا خَـيْرَ إِلاّ خَـيْرُك، وَلا إِلهَ غَيْـرُك"
    },
  
    {
      "index": 93,
      "name": "Supplication for when the mounted animal (or mean of transport) stumbles",
      "english": "In the name of Allah.",
      "arabic": "بِسْـمِ اللهِ "
    },
    {
      "index": 94,
      "name": "Supplication of the traveller for the resident",
      "english": "I place you in the trust of Allah, whose trust is never misplaced.",
      "arabic": "أَسْتَـوْدِعُكُـمُ اللَّهَ الَّذي لا تَضـيعُ وَدائِعُـه"
    },
    {
      "index": 95,
      "name": "Supplication of the resident for the traveller",
      "english": "I place your deen, your faithfulness and the ends of your deeds in the trust of Allah.",
      "arabic": "أَسْتَـوْدِعُ اللَّهَ ديـنَكَ وَأَمانَتَـكَ، وَخَـواتيـمَ عَمَـلِك"
    },
    {
      "index": 96,
      "name": "Remembrance while ascending or descending",
      "english": "While ascending: Allah is the greatest.\nand when descending: How perfect Allah is.",
      "arabic": "اللهُ أَكْـبَر / سُبْـحانَ الله"
    },
   
    {
      "index": 98,
      "name": "Stopping or lodging somewhere",
      "english": "I take refuge in Allah’s perfect words from the evil that He has created.",
      "arabic": "أَعـوذُ بِكَلِـماتِ اللّهِ التّـامّاتِ مِنْ شَـرِّ ما خَلَـق"
    },
    {
      "index": 100,
      "name": "What to say upon receiving pleasing or displeasing news",
      "english": "All Praise is for Allah by whose favour good works are accomplished.\nAll Praise is for Allah in all circumstances.",
      "arabic": "الْحَمْـدُ للهِ الَّذي بِنِـعْمَتِهِ تَتِـمُّ الصّـالِحات / الْحَمْـدُ للهِ على كُـلِّ حال"
    },
  
    {
      "index": 102,
      "name": "Excellence of spreading the Islamic greeting",
      "english": "The Messenger of Allah (saws) said: You shall not enter paradise until you believe, and you shall not believe until you love one another. Shall I not inform you of something, if you were to act upon it, you will indeed achieve mutual love for one another? Spread the greeting amongst yourselves.",
      "arabic": "السَّلامُ عَلَيْكُم"
    },
    {
      "index": 103,
      "name": "Supplication said upon hearing a rooster crow or the braying of an ass",
      "english": "If you hear the crow of a rooster, ask Allah for his bounty for it has seen an angel and if you hear the braying of an ass, seek refuge in Allah for it has seen a devil.",
      "arabic": "أَعـوذُ بِاللهِ مِنَ الشَّيْـطانِ الرَّجيـم"
    },
    {
      "index": 104,
      "name": "Supplication upon hearing the barking of dogs at night",
      "english": "If you hear the barking of dogs or the braying of asses at night, seek refuge in Allah for they see what you do not.",
      "arabic": "أَعـوذُ بِاللهِ مِنَ الشَّيْـطانِ الرَّجيـم"
    },
    {
      "index": 105,
      "name": "Supplication said for one you have insulted",
      "english": "O Allah, to any believer whom I have insulted, let that be cause to draw him near to You on the Day of Resurrection.",
      "arabic": "اللهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لهُ قُرْبةً إليكَ يَوْمَ القِيَامةِ"
    },
    {
      "index": 107,
      "name": "Supplication said between the Yemeni corner and the black stone (at the Kabah)",
      "english": "O our Lord, grant us the best in this life and the best in the next life, and protect us from the punishment of the Fire.",
      "arabic": "رَبَّنَا آتِنَا في الدُّنْيَا حسَنَةً وفي الآخِرَةِ حسَنةً وقِنَا عذَابَ النَّارِ"
    },
    {
      "index": 109,
      "name": "The Day of Arafah",
      "english": "None has the right to be worshipped except Allah, alone, without partner. To Him belongs all praise and sovereignty and He is over all things omnipotent.",
      "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَريكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ وهُوَ عَلَى كُلِّ شَيْءٍ قَديرٌ."
    },
    {
      "index": 110,
      "name": "At the Sacred Site (Al-Mashar Al-Haram)",
      "english": "Jabir said: He (saw) rode Al-Qaswa until he reached Al-Mashar Al-Haram, he then faced the qiblah, supplicated to Allah, and extoled His greatness and oneness. He stood until the sun shone but left before it rose.",
      "arabic": ""
    },
    {
      "index": 111,
      "name": "When throwing each pebble at the Jamarat",
      "english": "Every time the Prophet (saw) threw a pebble at any of the three jamarat, he would say:\nAllah is the greatest\n..on completion of the first jamarah, he advanced a little, stood facing the qiblah, raised his hands and supplicated. He also did this after the second jamarah but not the third.",
      "arabic": "اللهُ أَكْبَرُ"
    },
    {
      "index": 112,
      "name": "At the black stone",
      "english": "The Prophet (saw) circled the Kabah on a camel, every time he reached the black stone he would point to it with his staff and say: Allah is the greatest.",
      "arabic": "اللهُ أَكْبَرُ"
    },
    {
      "index": 113,
      "name": "Supplication made against an enemy",
      "english": "O Allah, Revealer of the Book, Swift at reckoning, defeat the confederates. O Allah, defeat them and convulse them.",
      "arabic": "اللَّهُمَّ مُنْزِلَ الكِتَابِ سَريعَ الحِسابِ اهْزِمَ الأَحْزَابَ اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ"
    },
    {
      "index": 114,
      "name": "What to say when in fear of a people",
      "english": "O Allah, protect me from them with what You choose.",
      "arabic": "اللَّهُمَّ اكْفِنِيهِمْ بِما شِئْتَ"
    },
    {
      "index": 115,
      "name": "What to say at times of amazement and delight",
      "english": "How perfect Allah is.",
      "arabic": "سُبْحَانَ اللهِ!"
    },
    {
      "index": 116,
      "name": "What to do upon receiving pleasant news",
      "english": "The Prophet (saw) would prostrate in gratitude to Allah (swt) upon receiving news which pleased him or which caused pleasure.",
      "arabic": ""
    },
    {
      "index": 117,
      "name": "What to say and do when feeling some pain in the body",
      "english": "Place your hand at the site of the pain and say: In the name of Allah (3 times). Then supplicate seven times: I take refuge in Allah and within His omnipotence from the evil that I feel and am wary of. (7 times)",
      "arabic": "بِسْمِ اللهِ (ثَلاثاً)\n\nأَعُوذُ باللهِ وَقُدْرَتِهِ مَنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ. (سبع مرات)"
    },
    {
      "index": 118,
      "name": "What to say when in fear of afflicting something or someone with one’s eye",
      "english": "O Allah, send blessing upon him. (This is) that which Allah has willed, there is no power except with Allah.",
      "arabic": "اللّهُـمَّ بارِك عَلَـيه\nما شاءَ الله، لا قُوَّةَ إلاّ بالله"
    },
    {
      "index": 119,
      "name": "Etiquette of retiring for the night",
      "english": "When night falls (i.e. Al-Maghrib), restrain your children (from going out) because at such time the devils spread about. After a period of time has passed, let them be. Shut your doors and mention Allah's name, for verily the devil does not open a shut door, tie up your water-skins and mention Allah's name, cover your vessels with anything and mention Allah's name and put out your lamps.",
      "arabic": ""
    },
    {
      "index": 120,
      "name": "The Talbiyah",
      "english": "Here I am O Allah, (in response to Your call), here I am. Here I am, You have no partner, here I am.  Verily all praise, grace and sovereignty belong to You. You have no partner.",
      "arabic": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الحّمْدَ والنِّعْمَةِ، لَكَ والمُلْكُ، لَا شَرِيكَ لَكَ"
    },
    {
      "index": 121,
      "name": "What to say when startled",
      "english": "None has the right to be worshipped except Allah.",
      "arabic": "لا إِلهَ إلاَّ اللهُ"
    },
    {
      "index": 122,
      "name": "What is said to a non-muslim when he sneezes",
      "english": "May Allah guide you and rectify your condition.",
      "arabic": "يَهْدِيكُمْ اللهُ ويُصلِحُ بًالَكُمْ"
    },
    {
      "index": 123,
      "name": "Returning a greeting to a non-muslim",
      "english": "And upon you.",
      "arabic": "وَعَلَـيكُم"
    },
    {
      "index": 124,
      "name": "When insulted while fasting",
      "english": "I am fasting, I am fasting.",
      "arabic": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ"
    },
    {
      "index": 125,
      "name": "When slaughtering or offering a sacrifice",
      "english": "In the name of Allah, and Allah is the greatest.  O Allah, (it is) from You and belongs to You, O Allah, accept this from me.",
      "arabic": "بِسْمِ اللهِ واللهُ أَكْبَرُ اللَّهُمَّ مِنْكَ ولَكَ اللَّهُمَّ تَقَبَّلْ مِنِّي."
    },
    {
      "index": 127,
      "name": "Seeking forgiveness and repentance",
      "english": "The Messenger of Allah (saw) said: By Allah, I seek forgiveness and repent to Allah, more than seventy times a day.",
      "arabic": ""
    },
   
    {
      "index": 129,
      "name": "How the prophet (saw) made tasbeeh",
      "english": "Abdullah ibn Amr said: I saw the prophet (saw) make tasbeeh with his right hand.",
      "arabic": ""
    },
    {
      "index": 132,
      "name": "Upon starting fast",
      "english": "I intend to keep the fast for tomorrow in the month of Ramadan",
      "arabic": "وَبِصَوْمِ غَدٍ نَّوَيْتُ مِنْ شَهْرِ رَمَضَانَ"
    },
    {
      "index": 133,
      "name": "For The Night of Power",
      "english": "O Allah, You are the Most forgiving, and You love to forgive, so forgive me.",
      "arabic": "الْلَّهُمَّ اِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي"
    },
    {
      "index": 134,
      "name": "For Protection",
      "english": "O Allah, I ask of Your pleasure and for Paradise, and I seek refuge from Your displeasure and from the Hellfire",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ"
    },
    {
      "index": 135,
      "name": "For increasing knowledge",
      "english": "My Lord, increase me in knowledge.",
      "arabic": "رَبِّ زِدْنِي عِلْمًا"
    },
    {
      "index": 136,
      "name": "For Direction",
      "english": "O Allah! Direct me to the Right Path and make me adhere to the Straight Path.",
      "arabic": "اللَّهُمَّ اهْدِني ، وسَدِّدْنِي"
    },
    {
      "index": 137,
      "name": "For Wisdom",
      "english": "O Allah, benefit me with what You have taught me, and teach me that which will benefit me, and increase me in knowledge.",
      "arabic": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَ عَلِّمْنِي مَا يَنْفَعُنِي وَ زِدْنِي عِلْمًا"
    },
    {
      "index": 138,
      "name": "For your parents",
      "english": "My Lord, have mercy upon them (parents) as they brought me up [when I was] small.",
      "arabic": "رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا"
    },
    {
      "index": 139,
      "name": "Supplication for health",
      "english": "O Allah, make me healthy in my body. O Allah, preserve for me my hearing. O Allah, preserve for me my sight. There is none worthy of worship but You . O Allah , I seek refuge in You from disbelief and poverty and I seek refuge in You from the punishment of the grave . There is none worthy of worship but You.",
      "arabic": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ. اللّهُـمَّ إِنّـي أَعـوذُبِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُبِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ"
    }
  ]